Revit 2027 API
Element.EvaluateAllParameterValues Method
 Evaluates all the parameters' values of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EvaluatedParameter> EvaluateAllParameterValues()
Public Function EvaluateAllParameterValues As IList(Of EvaluatedParameter)
public:
IList<EvaluatedParameter^>^ EvaluateAllParameterValues()
member EvaluateAllParameterValues : unit -> IList<EvaluatedParameter>
Return Value
IList<EvaluatedParameter>
 List of EvaluatedParameter of the element.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace